Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectEnumerator.Current Property
 Gets the current analysis object in the enumerator.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisObject Current { get; }
Public ReadOnly Property Current As AnalysisObject
	Get
Property Value
Type: AnalysisObject
See Also
Reference
AnalysisObjectEnumerator Class
Tekla.Structures.Analysis Namespace